

start_text = '''🎰 Добро пожаловать в наше увлекательное казино! 🎲

Здесь ты можешь испытать свою удачу, крутя барабан и выигрывая призы. Для начала игры используй команду /help для ознакомления с доступными командами.

Удачи и помни: удача улыбается смелым! 🍀
'''


help_text = '''📜 Список доступных команд:

/start - Начать игру и ознакомиться с правилами
/help - Справка по доступным командам
/balance - Проверить свой текущий баланс
/spin (сумма) - Сделать ставку и крутить барабан 🎡
/fill (сумма) - Пополнить свой баланс

Используй команды с умом и пусть удача будет на твоей стороне! 🍀
'''


wining_texts = [
    '''🎉 Поздравляем с выигрышем!

Ты выиграл(а) {} монет! Удача на твоей стороне! 🍀''',
    '🎲 Вау! Ты выиграл(а) {} монет! Продолжай в том же духе! 🎉',
    '🌟 Поздравляем с победой! Ты выиграл(а) {} монет! Наконец-то удача улыбнулась тебе! 🎲',
    '💰 Отлично! Ты выиграл(а) {выигрыш} монет! Продолжай играть и выигрывать больше! 🍀'
]


loosing_texts = [
    '😢 Увы, на этот раз удача была не на твоей стороне. Ты потерял(а) {} монет. Не отчаивайся, удача обязательно улыбнется тебе в следующий раз! 🍀',
    '🔄 Не повезло! Ты потерял(а) {} монет. Но не расстраивайся, настоящие победители не сдаются! Попробуй снова и выиграй! 🎲',
    '💸 Кажется, удача взяла выходной. Ты потерял(а) {} монет. Время показать ей, кто тут босс! Вернись и забери свое! 🎰',
    '😟 Ой-ой, ты потерял(а) {} монет. В следующий раз фортуна обязательно будет на твоей стороне. Не сдавайся! 🌟',
    '⚠️ Ты потерял(а) {} монет. Но помни, каждый проигрыш — это шаг к большому выигрышу! Вперед к победе! 💪',
    '🔴 Ты потерял(а) {} монет. Не позволяй этому остановить тебя! Пополни баланс командой /fill и попробуй еще раз. 🎡'
]


